earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico (pico-debug)
# -----------------------------------
rpipicopicodebug.name=Raspberry Pi Pico (pico-debug)
rpipicopicodebug.vid.0=0x1209
rpipicopicodebug.pid.0=0x2488
rpipicopicodebug.vid.1=0x1209
rpipicopicodebug.pid.1=0x2588
rpipicopicodebug.vid.2=0x1209
rpipicopicodebug.pid.2=0x6488
rpipicopicodebug.vid.3=0x1209
rpipicopicodebug.pid.3=0x6588
rpipicopicodebug.vid.4=0x1209
rpipicopicodebug.pid.4=0xa488
rpipicopicodebug.vid.5=0x1209
rpipicopicodebug.pid.5=0xa588
rpipicopicodebug.vid.6=0x1209
rpipicopicodebug.pid.6=0xe488
rpipicopicodebug.vid.7=0x1209
rpipicopicodebug.pid.7=0xe588
rpipicopicodebug.build.usbpid=-DSERIALUSB_PID=0x000a
rpipicopicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicopicodebug.build.board=RASPBERRY_PI_PICO
rpipicopicodebug.build.mcu=cortex-m0plus
rpipicopicodebug.build.variant=rpipico
rpipicopicodebug.upload.tool=picodebug
rpipicopicodebug.upload.maximum_size=2097152
rpipicopicodebug.upload.maximum_data_size=245760
rpipicopicodebug.upload.wait_for_upload_port=true
rpipicopicodebug.upload.erase_cmd=
rpipicopicodebug.serial.disableDTR=false
rpipicopicodebug.serial.disableRTS=false
rpipicopicodebug.build.f_cpu=125000000
rpipicopicodebug.build.led=
rpipicopicodebug.build.core=rp2040
rpipicopicodebug.build.ldscript=memmap_default.ld
rpipicopicodebug.build.ram_length=240k
rpipicopicodebug.build.boot2=boot2_w25q080_2_padded_checksum
rpipicopicodebug.build.vid=0x2e8a
rpipicopicodebug.build.pid=0x000a
rpipicopicodebug.build.usb_manufacturer="Raspberry Pi"
rpipicopicodebug.build.usb_product="Pico (pico-debug)"
rpipicopicodebug.menu.flash.2097152_0=2MB (no FS)
rpipicopicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicopicodebug.menu.flash.2097152_0.build.flash_length=2093056
rpipicopicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_0.build.fs_start=270528512
rpipicopicodebug.menu.flash.2097152_0.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicopicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicopicodebug.menu.flash.2097152_65536.build.flash_length=2027520
rpipicopicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_65536.build.fs_start=270462976
rpipicopicodebug.menu.flash.2097152_65536.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicopicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicopicodebug.menu.flash.2097152_131072.build.flash_length=1961984
rpipicopicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_131072.build.fs_start=270397440
rpipicopicodebug.menu.flash.2097152_131072.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicopicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicopicodebug.menu.flash.2097152_262144.build.flash_length=1830912
rpipicopicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_262144.build.fs_start=270266368
rpipicopicodebug.menu.flash.2097152_262144.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicopicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicopicodebug.menu.flash.2097152_524288.build.flash_length=1568768
rpipicopicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_524288.build.fs_start=270004224
rpipicopicodebug.menu.flash.2097152_524288.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicopicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicopicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicopicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicopicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicopicodebug.menu.freq.133=133 MHz
rpipicopicodebug.menu.freq.133.build.f_cpu=133000000L
rpipicopicodebug.menu.freq.50=50 MHz
rpipicopicodebug.menu.freq.50.build.f_cpu=50000000L
rpipicopicodebug.menu.freq.100=100 MHz
rpipicopicodebug.menu.freq.100.build.f_cpu=100000000L
rpipicopicodebug.menu.freq.120=120 MHz
rpipicopicodebug.menu.freq.120.build.f_cpu=120000000L
rpipicopicodebug.menu.freq.125=125 MHz
rpipicopicodebug.menu.freq.125.build.f_cpu=125000000L
rpipicopicodebug.menu.freq.150=150 MHz (Overclock)
rpipicopicodebug.menu.freq.150.build.f_cpu=150000000L
rpipicopicodebug.menu.freq.175=175 MHz (Overclock)
rpipicopicodebug.menu.freq.175.build.f_cpu=175000000L
rpipicopicodebug.menu.freq.200=200 MHz (Overclock)
rpipicopicodebug.menu.freq.200.build.f_cpu=200000000L
rpipicopicodebug.menu.freq.225=225 MHz (Overclock)
rpipicopicodebug.menu.freq.225.build.f_cpu=225000000L
rpipicopicodebug.menu.freq.240=240 MHz (Overclock)
rpipicopicodebug.menu.freq.240.build.f_cpu=240000000L
rpipicopicodebug.menu.freq.250=250 MHz (Overclock)
rpipicopicodebug.menu.freq.250.build.f_cpu=250000000L
rpipicopicodebug.menu.freq.275=275 MHz (Overclock)
rpipicopicodebug.menu.freq.275.build.f_cpu=275000000L
rpipicopicodebug.menu.freq.300=300 MHz (Overclock)
rpipicopicodebug.menu.freq.300.build.f_cpu=300000000L
rpipicopicodebug.menu.opt.Small=Small (-Os) (standard)
rpipicopicodebug.menu.opt.Small.build.flags.optimize=-Os
rpipicopicodebug.menu.opt.Optimize=Optimize (-O)
rpipicopicodebug.menu.opt.Optimize.build.flags.optimize=-O
rpipicopicodebug.menu.opt.Optimize2=Optimize More (-O2)
rpipicopicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicopicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicopicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicopicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicopicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicopicodebug.menu.opt.Debug=Debug (-Og)
rpipicopicodebug.menu.opt.Debug.build.flags.optimize=-Og
rpipicopicodebug.menu.rtti.Disabled=Disabled
rpipicopicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicopicodebug.menu.rtti.Enabled=Enabled
rpipicopicodebug.menu.rtti.Enabled.build.flags.rtti=
rpipicopicodebug.menu.stackprotect.Disabled=Disabled
rpipicopicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipicopicodebug.menu.stackprotect.Enabled=Enabled
rpipicopicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rpipicopicodebug.menu.exceptions.Disabled=Disabled
rpipicopicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipicopicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipicopicodebug.menu.exceptions.Enabled=Enabled
rpipicopicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipicopicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipicopicodebug.menu.dbgport.Disabled=Disabled
rpipicopicodebug.menu.dbgport.Disabled.build.debug_port=
rpipicopicodebug.menu.dbgport.Serial=Serial
rpipicopicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicopicodebug.menu.dbgport.Serial1=Serial1
rpipicopicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicopicodebug.menu.dbgport.Serial2=Serial2
rpipicopicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicopicodebug.menu.dbglvl.None=None
rpipicopicodebug.menu.dbglvl.None.build.debug_level=
rpipicopicodebug.menu.dbglvl.Core=Core
rpipicopicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicopicodebug.menu.dbglvl.SPI=SPI
rpipicopicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicopicodebug.menu.dbglvl.Wire=Wire
rpipicopicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicopicodebug.menu.dbglvl.All=All
rpipicopicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicopicodebug.menu.dbglvl.NDEBUG=NDEBUG
rpipicopicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicopicodebug.menu.usbstack.nousb=No USB
rpipicopicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
rpipicopicodebug.menu.ipstack.ipv4only=IPv4 Only
rpipicopicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
rpipicopicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipicopicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
rpipicopicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
rpipicopicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

# -----------------------------------
# Raspberry Pi Pico W
# -----------------------------------
rpipicow.name=Raspberry Pi Pico W
rpipicow.vid.0=0x2e8a
rpipicow.pid.0=0xf00a
rpipicow.vid.1=0x2e8a
rpipicow.pid.1=0xf10a
rpipicow.vid.2=0x2e8a
rpipicow.pid.2=0xf00a
rpipicow.vid.3=0x2e8a
rpipicow.pid.3=0xf10a
rpipicow.vid.4=0x2e8a
rpipicow.pid.4=0xf00a
rpipicow.vid.5=0x2e8a
rpipicow.pid.5=0xf10a
rpipicow.vid.6=0x2e8a
rpipicow.pid.6=0xf00a
rpipicow.vid.7=0x2e8a
rpipicow.pid.7=0xf10a
rpipicow.build.usbpid=-DSERIALUSB_PID=0xf00a
rpipicow.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicow.build.board=RASPBERRY_PI_PICO_W
rpipicow.build.mcu=cortex-m0plus
rpipicow.build.variant=rpipicow
rpipicow.upload.tool=uf2conv
rpipicow.upload.maximum_size=2097152
rpipicow.upload.maximum_data_size=262144
rpipicow.upload.wait_for_upload_port=true
rpipicow.upload.erase_cmd=
rpipicow.serial.disableDTR=false
rpipicow.serial.disableRTS=false
rpipicow.build.f_cpu=125000000
rpipicow.build.led=
rpipicow.build.core=rp2040
rpipicow.build.ldscript=memmap_default.ld
rpipicow.build.ram_length=256k
rpipicow.build.boot2=boot2_w25q080_2_padded_checksum
rpipicow.build.vid=0x2e8a
rpipicow.build.pid=0xf00a
rpipicow.build.usb_manufacturer="Raspberry Pi"
rpipicow.build.usb_product="Pico W"
rpipicow.menu.flash.2097152_0=2MB (no FS)
rpipicow.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicow.menu.flash.2097152_0.build.flash_length=2093056
rpipicow.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_0.build.fs_start=270528512
rpipicow.menu.flash.2097152_0.build.fs_end=270528512
rpipicow.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicow.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicow.menu.flash.2097152_65536.build.flash_length=2027520
rpipicow.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_65536.build.fs_start=270462976
rpipicow.menu.flash.2097152_65536.build.fs_end=270528512
rpipicow.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicow.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicow.menu.flash.2097152_131072.build.flash_length=1961984
rpipicow.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_131072.build.fs_start=270397440
rpipicow.menu.flash.2097152_131072.build.fs_end=270528512
rpipicow.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicow.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicow.menu.flash.2097152_262144.build.flash_length=1830912
rpipicow.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_262144.build.fs_start=270266368
rpipicow.menu.flash.2097152_262144.build.fs_end=270528512
rpipicow.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicow.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicow.menu.flash.2097152_524288.build.flash_length=1568768
rpipicow.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_524288.build.fs_start=270004224
rpipicow.menu.flash.2097152_524288.build.fs_end=270528512
rpipicow.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicow.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicow.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicow.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicow.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicow.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicow.menu.freq.133=133 MHz
rpipicow.menu.freq.133.build.f_cpu=133000000L
rpipicow.menu.freq.50=50 MHz
rpipicow.menu.freq.50.build.f_cpu=50000000L
rpipicow.menu.freq.100=100 MHz
rpipicow.menu.freq.100.build.f_cpu=100000000L
rpipicow.menu.freq.120=120 MHz
rpipicow.menu.freq.120.build.f_cpu=120000000L
rpipicow.menu.freq.125=125 MHz
rpipicow.menu.freq.125.build.f_cpu=125000000L
rpipicow.menu.freq.150=150 MHz (Overclock)
rpipicow.menu.freq.150.build.f_cpu=150000000L
rpipicow.menu.freq.175=175 MHz (Overclock)
rpipicow.menu.freq.175.build.f_cpu=175000000L
rpipicow.menu.freq.200=200 MHz (Overclock)
rpipicow.menu.freq.200.build.f_cpu=200000000L
rpipicow.menu.freq.225=225 MHz (Overclock)
rpipicow.menu.freq.225.build.f_cpu=225000000L
rpipicow.menu.freq.240=240 MHz (Overclock)
rpipicow.menu.freq.240.build.f_cpu=240000000L
rpipicow.menu.freq.250=250 MHz (Overclock)
rpipicow.menu.freq.250.build.f_cpu=250000000L
rpipicow.menu.freq.275=275 MHz (Overclock)
rpipicow.menu.freq.275.build.f_cpu=275000000L
rpipicow.menu.freq.300=300 MHz (Overclock)
rpipicow.menu.freq.300.build.f_cpu=300000000L
rpipicow.menu.opt.Small=Small (-Os) (standard)
rpipicow.menu.opt.Small.build.flags.optimize=-Os
rpipicow.menu.opt.Optimize=Optimize (-O)
rpipicow.menu.opt.Optimize.build.flags.optimize=-O
rpipicow.menu.opt.Optimize2=Optimize More (-O2)
rpipicow.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicow.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicow.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicow.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicow.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicow.menu.opt.Debug=Debug (-Og)
rpipicow.menu.opt.Debug.build.flags.optimize=-Og
rpipicow.menu.rtti.Disabled=Disabled
rpipicow.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicow.menu.rtti.Enabled=Enabled
rpipicow.menu.rtti.Enabled.build.flags.rtti=
rpipicow.menu.stackprotect.Disabled=Disabled
rpipicow.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipicow.menu.stackprotect.Enabled=Enabled
rpipicow.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rpipicow.menu.exceptions.Disabled=Disabled
rpipicow.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipicow.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipicow.menu.exceptions.Enabled=Enabled
rpipicow.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipicow.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipicow.menu.dbgport.Disabled=Disabled
rpipicow.menu.dbgport.Disabled.build.debug_port=
rpipicow.menu.dbgport.Serial=Serial
rpipicow.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicow.menu.dbgport.Serial1=Serial1
rpipicow.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicow.menu.dbgport.Serial2=Serial2
rpipicow.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicow.menu.dbglvl.None=None
rpipicow.menu.dbglvl.None.build.debug_level=
rpipicow.menu.dbglvl.Core=Core
rpipicow.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicow.menu.dbglvl.SPI=SPI
rpipicow.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicow.menu.dbglvl.Wire=Wire
rpipicow.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicow.menu.dbglvl.All=All
rpipicow.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicow.menu.dbglvl.NDEBUG=NDEBUG
rpipicow.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicow.menu.usbstack.picosdk=Pico SDK
rpipicow.menu.usbstack.picosdk.build.usbstack_flags=
rpipicow.menu.usbstack.tinyusb=Adafruit TinyUSB
rpipicow.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rpipicow.menu.ipstack.ipv4only=IPv4 Only
rpipicow.menu.ipstack.ipv4only.build.libpico=libpico.a
rpipicow.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipicow.menu.ipstack.ipv4ipv6=IPv4 and IPv6
rpipicow.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
rpipicow.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

