earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# ElectronicCats HunterCat NFC RP2040 (pico-debug)
# -----------------------------------
electroniccats_bombercatpicodebug.name=ElectronicCats HunterCat NFC RP2040 (pico-debug)
electroniccats_bombercatpicodebug.vid.0=0x1209
electroniccats_bombercatpicodebug.pid.0=0x2488
electroniccats_bombercatpicodebug.vid.1=0x1209
electroniccats_bombercatpicodebug.pid.1=0x2588
electroniccats_bombercatpicodebug.vid.2=0x1209
electroniccats_bombercatpicodebug.pid.2=0x6488
electroniccats_bombercatpicodebug.vid.3=0x1209
electroniccats_bombercatpicodebug.pid.3=0x6588
electroniccats_bombercatpicodebug.vid.4=0x1209
electroniccats_bombercatpicodebug.pid.4=0xa488
electroniccats_bombercatpicodebug.vid.5=0x1209
electroniccats_bombercatpicodebug.pid.5=0xa588
electroniccats_bombercatpicodebug.vid.6=0x1209
electroniccats_bombercatpicodebug.pid.6=0xe488
electroniccats_bombercatpicodebug.vid.7=0x1209
electroniccats_bombercatpicodebug.pid.7=0xe588
electroniccats_bombercatpicodebug.build.usbpid=-DSERIALUSB_PID=0x1209
electroniccats_bombercatpicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=500
electroniccats_bombercatpicodebug.build.board=ELECTRONICCATS_BOMBERCAT
electroniccats_bombercatpicodebug.build.mcu=cortex-m0plus
electroniccats_bombercatpicodebug.build.variant=electroniccats_bombercat
electroniccats_bombercatpicodebug.upload.tool=picodebug
electroniccats_bombercatpicodebug.upload.maximum_size=2097152
electroniccats_bombercatpicodebug.upload.maximum_data_size=245760
electroniccats_bombercatpicodebug.upload.wait_for_upload_port=true
electroniccats_bombercatpicodebug.upload.erase_cmd=
electroniccats_bombercatpicodebug.serial.disableDTR=false
electroniccats_bombercatpicodebug.serial.disableRTS=false
electroniccats_bombercatpicodebug.build.f_cpu=125000000
electroniccats_bombercatpicodebug.build.led=
electroniccats_bombercatpicodebug.build.core=rp2040
electroniccats_bombercatpicodebug.build.ldscript=memmap_default.ld
electroniccats_bombercatpicodebug.build.ram_length=240k
electroniccats_bombercatpicodebug.build.boot2=boot2_w25q080_2_padded_checksum
electroniccats_bombercatpicodebug.build.vid=0x1209
electroniccats_bombercatpicodebug.build.pid=0x1209
electroniccats_bombercatpicodebug.build.usb_manufacturer="ElectronicCats"
electroniccats_bombercatpicodebug.build.usb_product="HunterCat NFC RP2040 (pico-debug)"
electroniccats_bombercatpicodebug.menu.flash.2097152_0=2MB (no FS)
electroniccats_bombercatpicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
electroniccats_bombercatpicodebug.menu.flash.2097152_0.build.flash_length=2093056
electroniccats_bombercatpicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_0.build.fs_start=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_0.build.fs_end=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
electroniccats_bombercatpicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
electroniccats_bombercatpicodebug.menu.flash.2097152_65536.build.flash_length=2027520
electroniccats_bombercatpicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_65536.build.fs_start=270462976
electroniccats_bombercatpicodebug.menu.flash.2097152_65536.build.fs_end=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
electroniccats_bombercatpicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
electroniccats_bombercatpicodebug.menu.flash.2097152_131072.build.flash_length=1961984
electroniccats_bombercatpicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_131072.build.fs_start=270397440
electroniccats_bombercatpicodebug.menu.flash.2097152_131072.build.fs_end=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
electroniccats_bombercatpicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
electroniccats_bombercatpicodebug.menu.flash.2097152_262144.build.flash_length=1830912
electroniccats_bombercatpicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_262144.build.fs_start=270266368
electroniccats_bombercatpicodebug.menu.flash.2097152_262144.build.fs_end=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
electroniccats_bombercatpicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
electroniccats_bombercatpicodebug.menu.flash.2097152_524288.build.flash_length=1568768
electroniccats_bombercatpicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_524288.build.fs_start=270004224
electroniccats_bombercatpicodebug.menu.flash.2097152_524288.build.fs_end=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
electroniccats_bombercatpicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
electroniccats_bombercatpicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
electroniccats_bombercatpicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
electroniccats_bombercatpicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
electroniccats_bombercatpicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
electroniccats_bombercatpicodebug.menu.freq.133=133 MHz
electroniccats_bombercatpicodebug.menu.freq.133.build.f_cpu=133000000L
electroniccats_bombercatpicodebug.menu.freq.50=50 MHz
electroniccats_bombercatpicodebug.menu.freq.50.build.f_cpu=50000000L
electroniccats_bombercatpicodebug.menu.freq.100=100 MHz
electroniccats_bombercatpicodebug.menu.freq.100.build.f_cpu=100000000L
electroniccats_bombercatpicodebug.menu.freq.120=120 MHz
electroniccats_bombercatpicodebug.menu.freq.120.build.f_cpu=120000000L
electroniccats_bombercatpicodebug.menu.freq.125=125 MHz
electroniccats_bombercatpicodebug.menu.freq.125.build.f_cpu=125000000L
electroniccats_bombercatpicodebug.menu.freq.150=150 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.150.build.f_cpu=150000000L
electroniccats_bombercatpicodebug.menu.freq.175=175 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.175.build.f_cpu=175000000L
electroniccats_bombercatpicodebug.menu.freq.200=200 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.200.build.f_cpu=200000000L
electroniccats_bombercatpicodebug.menu.freq.225=225 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.225.build.f_cpu=225000000L
electroniccats_bombercatpicodebug.menu.freq.240=240 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.240.build.f_cpu=240000000L
electroniccats_bombercatpicodebug.menu.freq.250=250 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.250.build.f_cpu=250000000L
electroniccats_bombercatpicodebug.menu.freq.275=275 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.275.build.f_cpu=275000000L
electroniccats_bombercatpicodebug.menu.freq.300=300 MHz (Overclock)
electroniccats_bombercatpicodebug.menu.freq.300.build.f_cpu=300000000L
electroniccats_bombercatpicodebug.menu.opt.Small=Small (-Os) (standard)
electroniccats_bombercatpicodebug.menu.opt.Small.build.flags.optimize=-Os
electroniccats_bombercatpicodebug.menu.opt.Optimize=Optimize (-O)
electroniccats_bombercatpicodebug.menu.opt.Optimize.build.flags.optimize=-O
electroniccats_bombercatpicodebug.menu.opt.Optimize2=Optimize More (-O2)
electroniccats_bombercatpicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
electroniccats_bombercatpicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
electroniccats_bombercatpicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
electroniccats_bombercatpicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
electroniccats_bombercatpicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
electroniccats_bombercatpicodebug.menu.opt.Debug=Debug (-Og)
electroniccats_bombercatpicodebug.menu.opt.Debug.build.flags.optimize=-Og
electroniccats_bombercatpicodebug.menu.rtti.Disabled=Disabled
electroniccats_bombercatpicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
electroniccats_bombercatpicodebug.menu.rtti.Enabled=Enabled
electroniccats_bombercatpicodebug.menu.rtti.Enabled.build.flags.rtti=
electroniccats_bombercatpicodebug.menu.stackprotect.Disabled=Disabled
electroniccats_bombercatpicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
electroniccats_bombercatpicodebug.menu.stackprotect.Enabled=Enabled
electroniccats_bombercatpicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
electroniccats_bombercatpicodebug.menu.exceptions.Disabled=Disabled
electroniccats_bombercatpicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
electroniccats_bombercatpicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
electroniccats_bombercatpicodebug.menu.exceptions.Enabled=Enabled
electroniccats_bombercatpicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
electroniccats_bombercatpicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
electroniccats_bombercatpicodebug.menu.dbgport.Disabled=Disabled
electroniccats_bombercatpicodebug.menu.dbgport.Disabled.build.debug_port=
electroniccats_bombercatpicodebug.menu.dbgport.Serial=Serial
electroniccats_bombercatpicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
electroniccats_bombercatpicodebug.menu.dbgport.Serial1=Serial1
electroniccats_bombercatpicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
electroniccats_bombercatpicodebug.menu.dbgport.Serial2=Serial2
electroniccats_bombercatpicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
electroniccats_bombercatpicodebug.menu.dbglvl.None=None
electroniccats_bombercatpicodebug.menu.dbglvl.None.build.debug_level=
electroniccats_bombercatpicodebug.menu.dbglvl.Core=Core
electroniccats_bombercatpicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
electroniccats_bombercatpicodebug.menu.dbglvl.SPI=SPI
electroniccats_bombercatpicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
electroniccats_bombercatpicodebug.menu.dbglvl.Wire=Wire
electroniccats_bombercatpicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
electroniccats_bombercatpicodebug.menu.dbglvl.All=All
electroniccats_bombercatpicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
electroniccats_bombercatpicodebug.menu.dbglvl.NDEBUG=NDEBUG
electroniccats_bombercatpicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
electroniccats_bombercatpicodebug.menu.usbstack.nousb=No USB
electroniccats_bombercatpicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
electroniccats_bombercatpicodebug.menu.ipstack.ipv4only=IPv4 Only
electroniccats_bombercatpicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
electroniccats_bombercatpicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
electroniccats_bombercatpicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
electroniccats_bombercatpicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
electroniccats_bombercatpicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

