earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# iLabs Challenger 2040 WiFi (Picoprobe)
# -----------------------------------
challenger_2040_wifipicoprobe.name=iLabs Challenger 2040 WiFi (Picoprobe)
challenger_2040_wifipicoprobe.vid.0=0x2e8a
challenger_2040_wifipicoprobe.pid.0=0x0004
challenger_2040_wifipicoprobe.vid.1=0x2e8a
challenger_2040_wifipicoprobe.pid.1=0x0104
challenger_2040_wifipicoprobe.vid.2=0x2e8a
challenger_2040_wifipicoprobe.pid.2=0x4004
challenger_2040_wifipicoprobe.vid.3=0x2e8a
challenger_2040_wifipicoprobe.pid.3=0x4104
challenger_2040_wifipicoprobe.vid.4=0x2e8a
challenger_2040_wifipicoprobe.pid.4=0x8004
challenger_2040_wifipicoprobe.vid.5=0x2e8a
challenger_2040_wifipicoprobe.pid.5=0x8104
challenger_2040_wifipicoprobe.vid.6=0x2e8a
challenger_2040_wifipicoprobe.pid.6=0xc004
challenger_2040_wifipicoprobe.vid.7=0x2e8a
challenger_2040_wifipicoprobe.pid.7=0xc104
challenger_2040_wifipicoprobe.build.usbpid=-DSERIALUSB_PID=0x1006
challenger_2040_wifipicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
challenger_2040_wifipicoprobe.build.board=CHALLENGER_2040_WIFI_RP2040
challenger_2040_wifipicoprobe.build.mcu=cortex-m0plus
challenger_2040_wifipicoprobe.build.variant=challenger_2040_wifi
challenger_2040_wifipicoprobe.upload.tool=picoprobe
challenger_2040_wifipicoprobe.upload.maximum_size=8388608
challenger_2040_wifipicoprobe.upload.maximum_data_size=262144
challenger_2040_wifipicoprobe.upload.wait_for_upload_port=true
challenger_2040_wifipicoprobe.upload.erase_cmd=
challenger_2040_wifipicoprobe.serial.disableDTR=false
challenger_2040_wifipicoprobe.serial.disableRTS=false
challenger_2040_wifipicoprobe.build.f_cpu=125000000
challenger_2040_wifipicoprobe.build.led=
challenger_2040_wifipicoprobe.build.core=rp2040
challenger_2040_wifipicoprobe.build.ldscript=memmap_default.ld
challenger_2040_wifipicoprobe.build.ram_length=256k
challenger_2040_wifipicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
challenger_2040_wifipicoprobe.build.vid=0x2e8a
challenger_2040_wifipicoprobe.build.pid=0x1006
challenger_2040_wifipicoprobe.build.usb_manufacturer="iLabs"
challenger_2040_wifipicoprobe.build.usb_product="Challenger 2040 WiFi (Picoprobe)"
challenger_2040_wifipicoprobe.build.extra_flags=-DWIFIESPAT2
challenger_2040_wifipicoprobe.menu.flash.8388608_0=8MB (no FS)
challenger_2040_wifipicoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
challenger_2040_wifipicoprobe.menu.flash.8388608_0.build.flash_length=8384512
challenger_2040_wifipicoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_0.build.fs_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_0.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
challenger_2040_wifipicoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
challenger_2040_wifipicoprobe.menu.flash.8388608_65536.build.flash_length=8318976
challenger_2040_wifipicoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_65536.build.fs_start=276754432
challenger_2040_wifipicoprobe.menu.flash.8388608_65536.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
challenger_2040_wifipicoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
challenger_2040_wifipicoprobe.menu.flash.8388608_131072.build.flash_length=8253440
challenger_2040_wifipicoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_131072.build.fs_start=276688896
challenger_2040_wifipicoprobe.menu.flash.8388608_131072.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
challenger_2040_wifipicoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
challenger_2040_wifipicoprobe.menu.flash.8388608_262144.build.flash_length=8122368
challenger_2040_wifipicoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_262144.build.fs_start=276557824
challenger_2040_wifipicoprobe.menu.flash.8388608_262144.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
challenger_2040_wifipicoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
challenger_2040_wifipicoprobe.menu.flash.8388608_524288.build.flash_length=7860224
challenger_2040_wifipicoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_524288.build.fs_start=276295680
challenger_2040_wifipicoprobe.menu.flash.8388608_524288.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
challenger_2040_wifipicoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
challenger_2040_wifipicoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
challenger_2040_wifipicoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
challenger_2040_wifipicoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
challenger_2040_wifipicoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
challenger_2040_wifipicoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
challenger_2040_wifipicoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
challenger_2040_wifipicoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
challenger_2040_wifipicoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
challenger_2040_wifipicoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
challenger_2040_wifipicoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
challenger_2040_wifipicoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
challenger_2040_wifipicoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
challenger_2040_wifipicoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
challenger_2040_wifipicoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
challenger_2040_wifipicoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
challenger_2040_wifipicoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
challenger_2040_wifipicoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
challenger_2040_wifipicoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
challenger_2040_wifipicoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
challenger_2040_wifipicoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
challenger_2040_wifipicoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
challenger_2040_wifipicoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
challenger_2040_wifipicoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
challenger_2040_wifipicoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
challenger_2040_wifipicoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
challenger_2040_wifipicoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
challenger_2040_wifipicoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
challenger_2040_wifipicoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
challenger_2040_wifipicoprobe.menu.freq.133=133 MHz
challenger_2040_wifipicoprobe.menu.freq.133.build.f_cpu=133000000L
challenger_2040_wifipicoprobe.menu.freq.50=50 MHz
challenger_2040_wifipicoprobe.menu.freq.50.build.f_cpu=50000000L
challenger_2040_wifipicoprobe.menu.freq.100=100 MHz
challenger_2040_wifipicoprobe.menu.freq.100.build.f_cpu=100000000L
challenger_2040_wifipicoprobe.menu.freq.120=120 MHz
challenger_2040_wifipicoprobe.menu.freq.120.build.f_cpu=120000000L
challenger_2040_wifipicoprobe.menu.freq.125=125 MHz
challenger_2040_wifipicoprobe.menu.freq.125.build.f_cpu=125000000L
challenger_2040_wifipicoprobe.menu.freq.150=150 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.150.build.f_cpu=150000000L
challenger_2040_wifipicoprobe.menu.freq.175=175 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.175.build.f_cpu=175000000L
challenger_2040_wifipicoprobe.menu.freq.200=200 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.200.build.f_cpu=200000000L
challenger_2040_wifipicoprobe.menu.freq.225=225 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.225.build.f_cpu=225000000L
challenger_2040_wifipicoprobe.menu.freq.240=240 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.240.build.f_cpu=240000000L
challenger_2040_wifipicoprobe.menu.freq.250=250 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.250.build.f_cpu=250000000L
challenger_2040_wifipicoprobe.menu.freq.275=275 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.275.build.f_cpu=275000000L
challenger_2040_wifipicoprobe.menu.freq.300=300 MHz (Overclock)
challenger_2040_wifipicoprobe.menu.freq.300.build.f_cpu=300000000L
challenger_2040_wifipicoprobe.menu.opt.Small=Small (-Os) (standard)
challenger_2040_wifipicoprobe.menu.opt.Small.build.flags.optimize=-Os
challenger_2040_wifipicoprobe.menu.opt.Optimize=Optimize (-O)
challenger_2040_wifipicoprobe.menu.opt.Optimize.build.flags.optimize=-O
challenger_2040_wifipicoprobe.menu.opt.Optimize2=Optimize More (-O2)
challenger_2040_wifipicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
challenger_2040_wifipicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
challenger_2040_wifipicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
challenger_2040_wifipicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
challenger_2040_wifipicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
challenger_2040_wifipicoprobe.menu.opt.Debug=Debug (-Og)
challenger_2040_wifipicoprobe.menu.opt.Debug.build.flags.optimize=-Og
challenger_2040_wifipicoprobe.menu.rtti.Disabled=Disabled
challenger_2040_wifipicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
challenger_2040_wifipicoprobe.menu.rtti.Enabled=Enabled
challenger_2040_wifipicoprobe.menu.rtti.Enabled.build.flags.rtti=
challenger_2040_wifipicoprobe.menu.stackprotect.Disabled=Disabled
challenger_2040_wifipicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
challenger_2040_wifipicoprobe.menu.stackprotect.Enabled=Enabled
challenger_2040_wifipicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
challenger_2040_wifipicoprobe.menu.exceptions.Disabled=Disabled
challenger_2040_wifipicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
challenger_2040_wifipicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
challenger_2040_wifipicoprobe.menu.exceptions.Enabled=Enabled
challenger_2040_wifipicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
challenger_2040_wifipicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
challenger_2040_wifipicoprobe.menu.dbgport.Disabled=Disabled
challenger_2040_wifipicoprobe.menu.dbgport.Disabled.build.debug_port=
challenger_2040_wifipicoprobe.menu.dbgport.Serial=Serial
challenger_2040_wifipicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
challenger_2040_wifipicoprobe.menu.dbgport.Serial1=Serial1
challenger_2040_wifipicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
challenger_2040_wifipicoprobe.menu.dbgport.Serial2=Serial2
challenger_2040_wifipicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
challenger_2040_wifipicoprobe.menu.dbglvl.None=None
challenger_2040_wifipicoprobe.menu.dbglvl.None.build.debug_level=
challenger_2040_wifipicoprobe.menu.dbglvl.Core=Core
challenger_2040_wifipicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
challenger_2040_wifipicoprobe.menu.dbglvl.SPI=SPI
challenger_2040_wifipicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
challenger_2040_wifipicoprobe.menu.dbglvl.Wire=Wire
challenger_2040_wifipicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
challenger_2040_wifipicoprobe.menu.dbglvl.All=All
challenger_2040_wifipicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
challenger_2040_wifipicoprobe.menu.dbglvl.NDEBUG=NDEBUG
challenger_2040_wifipicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
challenger_2040_wifipicoprobe.menu.usbstack.picosdk=Pico SDK
challenger_2040_wifipicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
challenger_2040_wifipicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
challenger_2040_wifipicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
challenger_2040_wifipicoprobe.menu.ipstack.ipv4only=IPv4 Only
challenger_2040_wifipicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
challenger_2040_wifipicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
challenger_2040_wifipicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
challenger_2040_wifipicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
challenger_2040_wifipicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

