earlephilhower/arduino-pico/boards.txt
melopero_shake_rp2040picoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
melopero_shake_rp2040picoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
melopero_shake_rp2040picoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
melopero_shake_rp2040picoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
melopero_shake_rp2040picoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

# -----------------------------------
# Melopero Shake RP2040 (pico-debug)
# -----------------------------------
melopero_shake_rp2040picodebug.name=Melopero Shake RP2040 (pico-debug)
melopero_shake_rp2040picodebug.vid.0=0x1209
melopero_shake_rp2040picodebug.pid.0=0x2488
melopero_shake_rp2040picodebug.vid.1=0x1209
melopero_shake_rp2040picodebug.pid.1=0x2588
melopero_shake_rp2040picodebug.vid.2=0x1209
melopero_shake_rp2040picodebug.pid.2=0x6488
melopero_shake_rp2040picodebug.vid.3=0x1209
melopero_shake_rp2040picodebug.pid.3=0x6588
melopero_shake_rp2040picodebug.vid.4=0x1209
melopero_shake_rp2040picodebug.pid.4=0xa488
melopero_shake_rp2040picodebug.vid.5=0x1209
melopero_shake_rp2040picodebug.pid.5=0xa588
melopero_shake_rp2040picodebug.vid.6=0x1209
melopero_shake_rp2040picodebug.pid.6=0xe488
melopero_shake_rp2040picodebug.vid.7=0x1209
melopero_shake_rp2040picodebug.pid.7=0xe588
melopero_shake_rp2040picodebug.build.usbpid=-DSERIALUSB_PID=0x1005
melopero_shake_rp2040picodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
melopero_shake_rp2040picodebug.build.board=MELOPERO_SHAKE_RP2040
melopero_shake_rp2040picodebug.build.mcu=cortex-m0plus
melopero_shake_rp2040picodebug.build.variant=melopero_shake_rp2040
melopero_shake_rp2040picodebug.upload.tool=picodebug
melopero_shake_rp2040picodebug.upload.maximum_size=16777216
melopero_shake_rp2040picodebug.upload.maximum_data_size=245760
melopero_shake_rp2040picodebug.upload.wait_for_upload_port=true
melopero_shake_rp2040picodebug.upload.erase_cmd=
melopero_shake_rp2040picodebug.serial.disableDTR=false
melopero_shake_rp2040picodebug.serial.disableRTS=false
melopero_shake_rp2040picodebug.build.f_cpu=125000000
melopero_shake_rp2040picodebug.build.led=
melopero_shake_rp2040picodebug.build.core=rp2040
melopero_shake_rp2040picodebug.build.ldscript=memmap_default.ld
melopero_shake_rp2040picodebug.build.ram_length=240k
melopero_shake_rp2040picodebug.build.boot2=boot2_w25q080_2_padded_checksum
melopero_shake_rp2040picodebug.build.vid=0x2e8a
melopero_shake_rp2040picodebug.build.pid=0x1005
melopero_shake_rp2040picodebug.build.usb_manufacturer="Melopero"
melopero_shake_rp2040picodebug.build.usb_product="Shake RP2040 (pico-debug)"
melopero_shake_rp2040picodebug.menu.flash.16777216_0=16MB (no FS)
melopero_shake_rp2040picodebug.menu.flash.16777216_0.upload.maximum_size=16773120
melopero_shake_rp2040picodebug.menu.flash.16777216_0.build.flash_length=16773120
melopero_shake_rp2040picodebug.menu.flash.16777216_0.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_0.build.fs_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_0.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
melopero_shake_rp2040picodebug.menu.flash.16777216_65536.upload.maximum_size=16707584
melopero_shake_rp2040picodebug.menu.flash.16777216_65536.build.flash_length=16707584
melopero_shake_rp2040picodebug.menu.flash.16777216_65536.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_65536.build.fs_start=285143040
melopero_shake_rp2040picodebug.menu.flash.16777216_65536.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
melopero_shake_rp2040picodebug.menu.flash.16777216_131072.upload.maximum_size=16642048
melopero_shake_rp2040picodebug.menu.flash.16777216_131072.build.flash_length=16642048
melopero_shake_rp2040picodebug.menu.flash.16777216_131072.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_131072.build.fs_start=285077504
melopero_shake_rp2040picodebug.menu.flash.16777216_131072.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
melopero_shake_rp2040picodebug.menu.flash.16777216_262144.upload.maximum_size=16510976
melopero_shake_rp2040picodebug.menu.flash.16777216_262144.build.flash_length=16510976
melopero_shake_rp2040picodebug.menu.flash.16777216_262144.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_262144.build.fs_start=284946432
melopero_shake_rp2040picodebug.menu.flash.16777216_262144.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
melopero_shake_rp2040picodebug.menu.flash.16777216_524288.upload.maximum_size=16248832
melopero_shake_rp2040picodebug.menu.flash.16777216_524288.build.flash_length=16248832
melopero_shake_rp2040picodebug.menu.flash.16777216_524288.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_524288.build.fs_start=284684288
melopero_shake_rp2040picodebug.menu.flash.16777216_524288.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_1048576.upload.maximum_size=15724544
melopero_shake_rp2040picodebug.menu.flash.16777216_1048576.build.flash_length=15724544
melopero_shake_rp2040picodebug.menu.flash.16777216_1048576.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_1048576.build.fs_start=284160000
melopero_shake_rp2040picodebug.menu.flash.16777216_1048576.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_2097152.upload.maximum_size=14675968
melopero_shake_rp2040picodebug.menu.flash.16777216_2097152.build.flash_length=14675968
melopero_shake_rp2040picodebug.menu.flash.16777216_2097152.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_2097152.build.fs_start=283111424
melopero_shake_rp2040picodebug.menu.flash.16777216_2097152.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_3145728.upload.maximum_size=13627392
melopero_shake_rp2040picodebug.menu.flash.16777216_3145728.build.flash_length=13627392
melopero_shake_rp2040picodebug.menu.flash.16777216_3145728.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_3145728.build.fs_start=282062848
melopero_shake_rp2040picodebug.menu.flash.16777216_3145728.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_4194304.upload.maximum_size=12578816
melopero_shake_rp2040picodebug.menu.flash.16777216_4194304.build.flash_length=12578816
melopero_shake_rp2040picodebug.menu.flash.16777216_4194304.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_4194304.build.fs_start=281014272
melopero_shake_rp2040picodebug.menu.flash.16777216_4194304.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_5242880.upload.maximum_size=11530240
melopero_shake_rp2040picodebug.menu.flash.16777216_5242880.build.flash_length=11530240
melopero_shake_rp2040picodebug.menu.flash.16777216_5242880.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_5242880.build.fs_start=279965696
melopero_shake_rp2040picodebug.menu.flash.16777216_5242880.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_6291456.upload.maximum_size=10481664
melopero_shake_rp2040picodebug.menu.flash.16777216_6291456.build.flash_length=10481664
melopero_shake_rp2040picodebug.menu.flash.16777216_6291456.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_6291456.build.fs_start=278917120
melopero_shake_rp2040picodebug.menu.flash.16777216_6291456.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_7340032.upload.maximum_size=9433088
melopero_shake_rp2040picodebug.menu.flash.16777216_7340032.build.flash_length=9433088
melopero_shake_rp2040picodebug.menu.flash.16777216_7340032.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_7340032.build.fs_start=277868544
melopero_shake_rp2040picodebug.menu.flash.16777216_7340032.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_8388608.upload.maximum_size=8384512
melopero_shake_rp2040picodebug.menu.flash.16777216_8388608.build.flash_length=8384512
melopero_shake_rp2040picodebug.menu.flash.16777216_8388608.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_8388608.build.fs_start=276819968
melopero_shake_rp2040picodebug.menu.flash.16777216_8388608.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_9437184.upload.maximum_size=7335936
melopero_shake_rp2040picodebug.menu.flash.16777216_9437184.build.flash_length=7335936
melopero_shake_rp2040picodebug.menu.flash.16777216_9437184.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_9437184.build.fs_start=275771392
melopero_shake_rp2040picodebug.menu.flash.16777216_9437184.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_10485760.upload.maximum_size=6287360
melopero_shake_rp2040picodebug.menu.flash.16777216_10485760.build.flash_length=6287360
melopero_shake_rp2040picodebug.menu.flash.16777216_10485760.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_10485760.build.fs_start=274722816
melopero_shake_rp2040picodebug.menu.flash.16777216_10485760.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_11534336.upload.maximum_size=5238784
melopero_shake_rp2040picodebug.menu.flash.16777216_11534336.build.flash_length=5238784
melopero_shake_rp2040picodebug.menu.flash.16777216_11534336.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_11534336.build.fs_start=273674240
melopero_shake_rp2040picodebug.menu.flash.16777216_11534336.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_12582912.upload.maximum_size=4190208
melopero_shake_rp2040picodebug.menu.flash.16777216_12582912.build.flash_length=4190208
melopero_shake_rp2040picodebug.menu.flash.16777216_12582912.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_12582912.build.fs_start=272625664
melopero_shake_rp2040picodebug.menu.flash.16777216_12582912.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_13631488.upload.maximum_size=3141632
melopero_shake_rp2040picodebug.menu.flash.16777216_13631488.build.flash_length=3141632
melopero_shake_rp2040picodebug.menu.flash.16777216_13631488.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_13631488.build.fs_start=271577088
melopero_shake_rp2040picodebug.menu.flash.16777216_13631488.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_14680064.upload.maximum_size=2093056
melopero_shake_rp2040picodebug.menu.flash.16777216_14680064.build.flash_length=2093056
melopero_shake_rp2040picodebug.menu.flash.16777216_14680064.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_14680064.build.fs_start=270528512
melopero_shake_rp2040picodebug.menu.flash.16777216_14680064.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
melopero_shake_rp2040picodebug.menu.flash.16777216_15728640.upload.maximum_size=1044480
melopero_shake_rp2040picodebug.menu.flash.16777216_15728640.build.flash_length=1044480
melopero_shake_rp2040picodebug.menu.flash.16777216_15728640.build.eeprom_start=285208576
melopero_shake_rp2040picodebug.menu.flash.16777216_15728640.build.fs_start=269479936
melopero_shake_rp2040picodebug.menu.flash.16777216_15728640.build.fs_end=285208576
melopero_shake_rp2040picodebug.menu.freq.133=133 MHz
melopero_shake_rp2040picodebug.menu.freq.133.build.f_cpu=133000000L
melopero_shake_rp2040picodebug.menu.freq.50=50 MHz
melopero_shake_rp2040picodebug.menu.freq.50.build.f_cpu=50000000L
melopero_shake_rp2040picodebug.menu.freq.100=100 MHz
melopero_shake_rp2040picodebug.menu.freq.100.build.f_cpu=100000000L
melopero_shake_rp2040picodebug.menu.freq.120=120 MHz
melopero_shake_rp2040picodebug.menu.freq.120.build.f_cpu=120000000L
melopero_shake_rp2040picodebug.menu.freq.125=125 MHz
melopero_shake_rp2040picodebug.menu.freq.125.build.f_cpu=125000000L
melopero_shake_rp2040picodebug.menu.freq.150=150 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.150.build.f_cpu=150000000L
melopero_shake_rp2040picodebug.menu.freq.175=175 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.175.build.f_cpu=175000000L
melopero_shake_rp2040picodebug.menu.freq.200=200 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.200.build.f_cpu=200000000L
melopero_shake_rp2040picodebug.menu.freq.225=225 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.225.build.f_cpu=225000000L
melopero_shake_rp2040picodebug.menu.freq.240=240 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.240.build.f_cpu=240000000L
melopero_shake_rp2040picodebug.menu.freq.250=250 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.250.build.f_cpu=250000000L
melopero_shake_rp2040picodebug.menu.freq.275=275 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.275.build.f_cpu=275000000L
melopero_shake_rp2040picodebug.menu.freq.300=300 MHz (Overclock)
melopero_shake_rp2040picodebug.menu.freq.300.build.f_cpu=300000000L
melopero_shake_rp2040picodebug.menu.opt.Small=Small (-Os) (standard)
melopero_shake_rp2040picodebug.menu.opt.Small.build.flags.optimize=-Os
melopero_shake_rp2040picodebug.menu.opt.Optimize=Optimize (-O)
melopero_shake_rp2040picodebug.menu.opt.Optimize.build.flags.optimize=-O
melopero_shake_rp2040picodebug.menu.opt.Optimize2=Optimize More (-O2)
melopero_shake_rp2040picodebug.menu.opt.Optimize2.build.flags.optimize=-O2
melopero_shake_rp2040picodebug.menu.opt.Optimize3=Optimize Even More (-O3)
melopero_shake_rp2040picodebug.menu.opt.Optimize3.build.flags.optimize=-O3
melopero_shake_rp2040picodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
melopero_shake_rp2040picodebug.menu.opt.Fast.build.flags.optimize=-Ofast
melopero_shake_rp2040picodebug.menu.opt.Debug=Debug (-Og)
melopero_shake_rp2040picodebug.menu.opt.Debug.build.flags.optimize=-Og
melopero_shake_rp2040picodebug.menu.rtti.Disabled=Disabled
melopero_shake_rp2040picodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
melopero_shake_rp2040picodebug.menu.rtti.Enabled=Enabled
melopero_shake_rp2040picodebug.menu.rtti.Enabled.build.flags.rtti=
melopero_shake_rp2040picodebug.menu.stackprotect.Disabled=Disabled
melopero_shake_rp2040picodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
melopero_shake_rp2040picodebug.menu.stackprotect.Enabled=Enabled
melopero_shake_rp2040picodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
melopero_shake_rp2040picodebug.menu.exceptions.Disabled=Disabled
melopero_shake_rp2040picodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
melopero_shake_rp2040picodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
melopero_shake_rp2040picodebug.menu.exceptions.Enabled=Enabled
melopero_shake_rp2040picodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
melopero_shake_rp2040picodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
melopero_shake_rp2040picodebug.menu.dbgport.Disabled=Disabled
melopero_shake_rp2040picodebug.menu.dbgport.Disabled.build.debug_port=
melopero_shake_rp2040picodebug.menu.dbgport.Serial=Serial
melopero_shake_rp2040picodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
melopero_shake_rp2040picodebug.menu.dbgport.Serial1=Serial1
melopero_shake_rp2040picodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
melopero_shake_rp2040picodebug.menu.dbgport.Serial2=Serial2
melopero_shake_rp2040picodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
melopero_shake_rp2040picodebug.menu.dbglvl.None=None
melopero_shake_rp2040picodebug.menu.dbglvl.None.build.debug_level=
melopero_shake_rp2040picodebug.menu.dbglvl.Core=Core
melopero_shake_rp2040picodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
melopero_shake_rp2040picodebug.menu.dbglvl.SPI=SPI
melopero_shake_rp2040picodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
melopero_shake_rp2040picodebug.menu.dbglvl.Wire=Wire
melopero_shake_rp2040picodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
melopero_shake_rp2040picodebug.menu.dbglvl.All=All
melopero_shake_rp2040picodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
melopero_shake_rp2040picodebug.menu.dbglvl.NDEBUG=NDEBUG
melopero_shake_rp2040picodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
melopero_shake_rp2040picodebug.menu.usbstack.nousb=No USB
